---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsLightingStudyType
source: html/aa48b546-e844-1d7f-7f5b-132ef04a52d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsLightingStudyType Property

"Lighting study"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyIsLightingStudyType { get; }
```